# Taps

tap 'git-time-metric/gtm'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'

# Dependencies

cask 'java8'  # elasticsearch@5.6

# CLI

brew 'direnv'
brew 'elasticsearch@5.6'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'go'
brew 'gtm'
brew 'homeshick'
brew 'htop-osx'
brew 'jq'
brew 'mas'
brew 'md5sha1sum'
brew 'mercurial'
brew 'mosh'
brew 'nginx'
brew 'node@8'
brew 'p7zip'
brew 'par2'
brew 'pv'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'rclone'
brew 'redis'
brew 'restic'
brew 'sloccount'
brew 'sqlite'
brew 'supervisor'
brew 'telnet'
brew 'tig'
brew 'tmux'
brew 'transcrypt'
brew 'unrar'
brew 'wakeonlan'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'zsh'

# GUI

# cask 'dropbox'
# cask 'eyetv'
# cask 'flash'
# cask 'fontexplorer-x-pro'
# cask 'handbrake'
# cask 'jetbrains-toolbox'
# cask 'kindle'
# cask 'omnigraffle'
# cask 'openzfs'
# cask 'plex-media-server'
# cask 'sabnzbd'
# cask 'sketchup'
# cask 'steam'
# cask 'unetbootin'
# cask 'vlc'
cask '1password'
cask 'appzapper'
cask 'arq'
cask 'balenaetcher'
cask 'bartender'
cask 'caffeine'
cask 'carbon-copy-cloner'
cask 'cleanmymac3'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'franz'
cask 'github'
cask 'gitkraken'
cask 'gitup'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'google-photos-backup-and-sync'
cask 'hazel'
cask 'istat-menus'
cask 'macs-fan-control'
cask 'marshallofsound-google-play-music-player'
cask 'microsoft-office'
cask 'moom'
cask 'osxfuse'
cask 'port-map'
cask 'postgres'
cask 'pycharm'
cask 'resilio-sync'
cask 'sidekick'
cask 'skype'
cask 'slack'
cask 'softraid'
cask 'sourcetree'
cask 'sublime-merge'
cask 'sublime-text'
cask 'tower'
cask 'transmission'
cask 'transmit'
cask 'tripmode'
cask 'visual-studio-code'
cask 'vmware-fusion8'
cask 'wacom-tablet'
cask 'xquartz'
cask 'zoomus'

# Mac App Store

# mas 'QR Journal', id: 483820530
mas 'Aperture', id: 408981426
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'Deckset', id: 847496013
mas 'Freckle', id: 879917538
mas 'Trello', id: 1278508951
mas 'Ulysses', id: 623795237

# Beets

# brew 'aacgain'
# brew 'chromaprint'
# brew 'faac'
# brew 'ffmpeg'
# brew 'flac'
# brew 'lame'

# Syrinscape

# brew 'sox', args: ['with-flac', 'with-lame', 'with-libvorbis']
# brew 'swig'
# cask 'java8'
# cask 'unity-android-support-for-editor'
# cask 'unity-ios-support-for-editor'
# cask 'unity-web-player'
# cask 'unity-windows-support-for-editor'
# cask 'unity@5.5.6'
# mas 'Asset Catalog Creator Pro', id: 809625456
# mas 'Xcode', id: 497799835
