# Taps

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/versions'

# General

brew 'git'
brew 'htop-osx'
# brew 'openzfs'
brew 'p7zip'
brew 'unrar'
brew 'wakeonlan'
brew 'wget'
# brew 'znc'
brew 'zsh'

# General GUI

cask '1password'  # Install from App Store for iCloud support
cask 'adium'
cask 'appzapper'
cask 'arq'
cask 'bittorrent-sync'
cask 'caffeine'
cask 'carbon-copy-cloner'
cask 'dropbox'
cask 'firefox'
# cask 'flash'
# cask 'fontexplorer-x-pro'
cask 'google-chrome'  # Install manually for App Store 1Password compatibility
cask 'hazel'
cask 'istat-menus'
cask 'macs-fan-control'
# cask 'microsoft-office'
cask 'moom'
cask 'omnigraffle'
cask 'sabnzbd'
cask 'skype'
cask 'sublime-text-dev'
cask 'transmission'
cask 'transmit'
cask 'unetbootin'
cask 'vlc'
cask 'vmware-fusion'
cask 'xquartz'

# Beets

brew 'aacgain'
brew 'chromaprint'
brew 'faac'
brew 'ffmpeg'
brew 'flac'
brew 'lame'

# Developer

brew 'mercurial'
brew 'nginx'
brew 'node'
# brew 'postgresql'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'sloccount'
brew 'sqlite'

# Developer GUI

cask 'github'
cask 'port-map'
cask 'postgres'
cask 'sourcetree'

# Personal GUI

# cask 'e-tax2014'
cask 'eyetv'
cask 'handbrake'
cask 'plex-home-theater'
cask 'plex-media-server'
# cask 'sketchup'
cask 'steam'
cask 'wacom-tablet'

# IC GUI
# cask 'hipchat'
